Revit 2024 API
ConnectorManager.UnusedConnectors Property
Return all the unused Connectors of the Connector Manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ConnectorSet UnusedConnectors { get; }
Visual Basic
Public ReadOnly Property UnusedConnectors As ConnectorSet
	Get
Visual C++
public:
property ConnectorSet^ UnusedConnectors {
	ConnectorSet^ get ();
}
Remarks
This property is used to retrieve the unused Connectors from the Connector Manager.
See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace